# Ex1 - Filtering and Sorting Data

This time we are going to pull data directly from the internet.
Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv).

In [2]:
chipo = pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv",delimiter="\t")

### Step 3. Assign it to a variable called chipo.

In [3]:
chipo.head(5)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

### Step 4. How many products cost more than $10.00?

In [8]:
list_item_price = chipo['item_price'].replace(["\$"],"",regex=True).astype(float)

In [9]:
count =0
for i in list_item_price:
    if(i>10.00):
        count +=1
print(count)

1130

In [22]:
chipo['item_price'] = chipo['item_price'].replace(["\$"],"",regex=True).astype(float)

In [25]:
chipo_sol = chipo[chipo['item_price'] > 10]
print(len(chipo_sol))

1130

### Step 5. What is the price of each item? 
###### print a data frame with only two columns item_name and item_price

In [13]:
chipo1 = chipo[['item_name','item_price']]

In [14]:
chipo1.head()

                               item_name item_price
0           Chips and Fresh Tomato Salsa     $2.39
1                                   Izze     $3.39
2                       Nantucket Nectar     $3.39
3  Chips and Tomatillo-Green Chili Salsa     $2.39
4                           Chicken Bowl    $16.98

In [26]:
chipo1.sort_values(by='item_price',ascending=False)

                item_name item_price
2624     Steak Salad Bowl     $9.39
4419     Steak Salad Bowl     $9.39
4036     Steak Salad Bowl     $9.39
1825  Barbacoa Salad Bowl     $9.39
3115  Carnitas Salad Bowl     $9.39
...                   ...        ...
3145          Canned Soda     $1.09
414           Canned Soda     $1.09
3162          Canned Soda     $1.09
821           Canned Soda     $1.09
1457          Canned Soda     $1.09

[4622 rows x 2 columns]

### Step 6. Sort by the name of the item

In [15]:
chipo.sort_values('item_name')
#chipo.sort_values(by='item_name')

,order_id,quantity,item_name,choice_description,item_price
3389,1360,2,6 Pack Soft Drink,[Diet Coke],$12.98
341,148,1,6 Pack Soft Drink,[Diet Coke],$6.49
1849,749,1,6 Pack Soft Drink,[Coke],$6.49
1860,754,1,6 Pack Soft Drink,[Diet Coke],$6.49
2713,1076,1,6 Pack Soft Drink,[Coke],$6.49
...,...,...,...,...,...
2384,948,1,Veggie Soft Tacos,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",$8.75
781,322,1,Veggie Soft Tacos,"[Fresh Tomato Salsa, [Black Beans, Cheese, Sou...",$8.75
2851,1132,1,Veggie Soft Tacos,"[Roasted Chili Corn Salsa (Medium), [Black Bea...",$8.49
1699,688,1,Veggie Soft Tacos,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",$11.25
1395,567,1,Veggie Soft Tacos,"[Fresh Tomato Salsa (Mild), [Pinto Beans, Rice...",$8.49

### Step 7. What was the quantity of the most expensive item ordered?

In [31]:
chipo1 = chipo.sort_values(by="item_price",ascending=False)
chipo1['quantity'].head(1)

3598    15
Name: quantity, dtype: int64

### Step 8. How many times were a Veggie Salad Bowl ordered?

In [18]:
count =0
for i in chipo['item_name']:
    if i == 'Veggie Salad Bowl':
        count+=1
print(count)

18

In [39]:
chipo10 = chipo['item_name'].value_counts()
chipo10["Veggie Salad Bowl"]

18

### Step 9. How many times people orderd more than one Canned Soda?

In [51]:
chipo10 = chipo[(chipo.item_name == 'Canned Soda') & (chipo.quantity > 1)]
len(chipo10)

20